Reddit_Clone/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by_username(username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Lane"], ["LIMIT", 1]]