Reddit_Clone/app/controllers/application_controller.rb

    def is_moderator?
        sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]