Reddit_Clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dsf"], ["url", "sdfa"], ["content", "asdfsd"], ["author_id", 2], ["created_at", "2021-02-15 22:33:26.552332"], ["updated_at", "2021-02-15 22:33:26.552332"]]

    def update
        @post = Post.find_by(id: params[:id])
        if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "Testing Post !!"], ["url", "appacademy.io!!!"], ["content", "This is our first post!!"], ["updated_at", "2021-02-15 21:30:34.688644"], ["id", 1]]