Reddit_Clone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.mod_id = current_user.id

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "This is our Sub"], ["description", "This is our sub, we are subbing."], ["mod_id", 2], ["created_at", "2021-02-15 19:34:55.413346"], ["updated_at", "2021-02-15 19:34:55.413346"]]