Reddit_Clone/app/views/users/show.html.erb

SELECT "subs".* FROM "subs" WHERE "subs"."mod_id" = $1  [["mod_id", 2]]
---

    <% @user.subs_modded.each do |sub| %>